[{"actors":["Elijah Wood","Ian McKellen","Liv Tyler","Viggo Mortensen"],"img":"https:\/\/upload.wikimedia.org\/wikipedia\/en\/f\/fb\/Lord_Rings_Fellowship_Ring.jpg","year":2001,"title":"The Lord of the Rings: The Fellowship of the Ring","desc":"epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson, based on 1954's The Fellowship of the Ring"},{"actors":["Sean Astin","Cate Blanchett","John Rhys-Davies","Christopher Lee"],"img":"https:\/\/upload.wikimedia.org\/wikipedia\/en\/a\/a1\/Lord_Rings_Two_Towers.jpg","year":2002,"title":"The Lord of the Rings: The Two Towers","desc":"epic high fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, Stephen Sinclair, and Jackson, based on 1954's The Two Towers, the second volume of the novel The Lord of the Rings by J. R. R. Tolkien."},{"actors":["Hugo Weaving","Miranda Otto","David Wenham","Karl Urban","John Noble","Andy Serkis","Ian Holm","Sean Bean"],"img":"https:\/\/upload.wikimedia.org\/wikipedia\/en\/4\/48\/Lord_Rings_Return_King.jpg","year":2023,"title":"The Lord of the Rings: The Return of the King","desc":"epic high fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson. It is based on 1955's The Return of the King, the third volume of the novel The Lord of the Rings by J. R. R. Tolkien."},{"actors":["Ian McKellen","Martin Freeman","Richard Armitage"],"img":"https:\/\/upload.wikimedia.org\/wikipedia\/en\/a\/a9\/The_Hobbit_trilogy_dvd_cover.jpg","year":2012,"title":"Cover of The Hobbit: The Motion Picture Trilogy","desc":"The Hobbit is a series of three epic high fantasy adventure films directed by Peter Jackson. The films are subtitled An Unexpected Journey (2012), The Desolation of Smaug (2013), and The Battle of the Five Armies (2014).[5] The films are based on the 1937 novel The Hobbit by J. R. R. Tolkien, with large portions of the trilogy inspired by the appendices to The Return of the King, which expand on the story told in The Hobbit, as well as new material and characters written especially for the films. Together they act as a prequel to Jackson's The Lord of the Rings film trilogy."}]